[
  {
    "bookId": 1,
    "bookName": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/6bHySWp/img1.jpg",
    "review": "The Lord of the Rings is an epic fantasy masterpiece that transports readers to the enchanting world of Middle-earth. With its richly developed characters, intricate plotlines, and immersive world-building, it captivates audiences of all ages. Tolkien's storytelling prowess shines through, weaving together themes of friendship, courage, and the battle between good and evil. This timeless classic continues to inspire readers worldwide and has left an indelible mark on the fantasy genre.",
    "totalPages": 1178,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Adventure", "Quest", "Magic"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1954
  },
  {
    "bookId": 2,
    "bookName": "Harry Potter and the Philosopher's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/XJBny9F/img2.jpg",
    "review": "Harry Potter and the Philosopher's Stone introduces readers to the magical world of Hogwarts and the boy who lived. J.K. Rowling's debut novel is a delightful blend of whimsy, adventure, and heartwarming themes. As Harry navigates the challenges of school, friendship, and discovering his true identity, readers are drawn into a spellbinding journey filled with magic and wonder. This enchanting tale has captured the imaginations of millions, making it a beloved classic for both children and adults alike.",
    "totalPages": 332,
    "rating": 4.7,
    "category": "Fantasy",
    "tags": ["Magic", "Adventure", "Friendship"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 3,
    "bookName": "The Hitchhiker's Guide to the Galaxy",
    "author": "Douglas Adams",
    "image": "https://i.ibb.co/6Z6x6hK/img3.jpg",
    "review": "The Hitchhiker's Guide to the Galaxy is a hilarious science fiction adventure through space. Douglas Adams' quirky humor and imaginative storytelling create a whimsical journey that defies expectations at every turn. From the absurdity of the universe to the eccentric cast of characters, this book delights readers with its wit and charm. It's a must-read for anyone seeking an out-of-this-world experience that will leave them laughing out loud.",
    "totalPages": 193,
    "rating": 4.5,
    "category": "Science Fiction",
    "tags": ["Humor", "Adventure", "Space"],
    "publisher": "Pan Books",
    "yearOfPublishing": 1979
  },
  {
    "bookId": 4,
    "bookName": "Crime and Punishment",
    "author": "Fyodor Dostoevsky",
    "image": "https://i.ibb.co/GdT8Drr/img4.jpg",
    "review": "Crime and Punishment is a profound psychological novel exploring the moral dilemmas of a young man. Fyodor Dostoevsky's masterpiece delves into the depths of the human psyche, examining themes of guilt, redemption, and the nature of evil. Through the complex character of Raskolnikov, readers are confronted with questions about morality and the consequences of one's actions. This thought-provoking work continues to resonate with readers, offering profound insights into the human condition.",
    "totalPages": 671,
    "rating": 4.6,
    "category": "Classic",
    "tags": ["Psychological", "Russian Literature", "Crime"],
    "publisher": "The Russian Messenger",
    "yearOfPublishing": 1866
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/JKq7NQ2/img5.jpg",
    "review": "The Catcher in the Rye is a coming-of-age novel that resonates with teenagers and adults alike. J.D. Salinger's iconic protagonist, Holden Caulfield, captures the disillusionment and angst of adolescence with raw honesty and authenticity. As Holden navigates the complexities of growing up and finding his place in the world, readers are drawn into a journey of self-discovery and existential reflection. This timeless classic continues to speak to readers of all generations, offering insights into the universal struggles of youth.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Bildungsroman", "Young Adult", "Rebellion"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/j6ttbhD/img6.jpg",
    "review": "1984 is a chilling dystopian novel that remains relevant in today's world. George Orwell's cautionary tale of totalitarianism and surveillance serves as a stark warning against the dangers of authoritarianism and the erosion of individual freedoms. Through the oppressive society of Oceania and the character of Winston Smith, readers are confronted with the terrifying consequences of unchecked government power. This prophetic work continues to provoke thought and discussion about the nature of society and the importance of freedom.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Dystopian", "Political", "Philosophical"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },

  {
    "bookId": 7,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/3zCsqFW/img7.jpg",
    "review": "The Great Gatsby is a magnificent portrayal of the Jazz Age and the American Dream. F. Scott Fitzgerald's masterpiece captures the essence of an era characterized by excess, ambition, and disillusionment. Through the enigmatic figure of Jay Gatsby and the eyes of narrator Nick Carraway, readers are immersed in a world of wealth, romance, and tragedy. Fitzgerald's lyrical prose and vivid imagery paint a vivid picture of 1920s America, making this novel a timeless classic that continues to resonate with readers today.",
    "totalPages": 180,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Classics", "Romance", "Tragedy"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 8,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/z8vbJC8/img9.jpg",
    "review": "Pride and Prejudice is a timeless romantic novel with memorable characters and witty dialogue. Jane Austen's classic tale of love, class, and society's expectations is as relevant today as it was when it was first published. Through the spirited Elizabeth Bennet and the aloof Mr. Darcy, Austen explores themes of prejudice, first impressions, and the complexity of human relationships. With its sparkling wit and incisive social commentary, Pride and Prejudice remains one of the most beloved novels in English literature.",
    "totalPages": 279,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Romance", "Satire", "Social Commentary"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 9,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/DwYyRXX/img8.jpg",
    "review": "The Hobbit is a captivating adventure that transports readers to the enchanting world of Middle-earth. J.R.R. Tolkien's delightful tale follows the journey of Bilbo Baggins, a reluctant hero who embarks on a quest to reclaim treasure guarded by the fearsome dragon Smaug. Along the way, Bilbo encounters elves, dwarves, and a mysterious creature named Gollum, testing his courage and resourcefulness. Filled with magic, friendship, and perilous escapades, The Hobbit is a timeless classic that appeals to readers of all ages.",
    "totalPages": 310,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Adventure", "Quest", "Magic"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  }
]
